In [2]:
import pandas as pd

d = {"USN":[100,101,102],
     "Name":[None, "tom", "ramesh"],
     "Mobile":[99,88,77],
     "marks":[30,35,None],
    }

In [5]:
#mod1
std = pd.DataFrame(d)

In [6]:
std.head()

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [7]:
std.head(2)

   USN  Name  Mobile  marks
0  100  None      99   30.0
1  101   tom      88   35.0

In [8]:
std.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    2 non-null      object
 2   Mobile  3 non-null      int64
 3   marks   2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [14]:
std.isnull()

     USN   Name  Mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [9]:
#accessing columns
std["USN"]
#multiple columns
std[["USN", "marks"]]

   USN  marks
0  100   30.0
1  101   35.0
2  102    NaN

In [10]:
#getting the rows 
std.loc[1]

USN        101
Name       tom
Mobile      88
marks     35.0
Name: 1, dtype: object

In [11]:
#question
cars = {"car_id":[100,101,102,103,104,105],
        "car_name":["ecosport", "jaguar", "supra","Polo GT", "Audi Q5",None],
        
}

In [12]:
df = pd.DataFrame(cars)

In [78]:
df

   car_id  car_name
0     100  ecosport
1     101    jaguar
2     102     supra
3     103   Polo GT
4     104   Audi Q5
5     105      None

In [13]:
df.head(3)

   car_id  car_name
0     100  ecosport
1     101    jaguar
2     102     supra

In [14]:
df.loc[3]

car_id          103
car_name    Polo GT
Name: 3, dtype: object

In [15]:
df.isnull()

   car_id  car_name
0   False     False
1   False     False
2   False     False
3   False     False
4   False     False
5   False      True

In [16]:
df.iloc[4]

car_id          104
car_name    Audi Q5
Name: 4, dtype: object

In [20]:
#setting a new index
index = ["A","B","C"]
std.set_index("USN")

# # #or 
# D = std.DataFrame(d, index = ["A","B","C"])

std

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [18]:
#conditional selection
std["marks"]<35

0     True
1    False
2    False
Name: marks, dtype: bool

In [19]:
#if you want the values
std.loc[std["marks"]<35]

#or

   USN  Name  Mobile  marks
0  100  None      99   30.0

In [24]:
newdf = std["marks"]<35
std[newdf][["Name","Mobile","USN"]]

   Name  Mobile  USN
0  None      99  100

In [41]:
#multiple conditions
std[(std["Name"] == "jerry")&(std["marks"]>20)]

   USN   Name  Mobile  marks
0  100  jerry      99   30.0

In [43]:
std[(std["USN"]>100)|(std["marks"]<40)]

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [47]:
#adding new column
s = "banglore,delhi,kashmir".split(",")
print(s,type)
std["Address"] = s
std

['banglore', 'delhi', 'kashmir'] <class 'type'>

   USN    Name  Mobile  marks   Address
0  100   jerry      99   30.0  banglore
1  101     tom      88   35.0     delhi
2  102  ramesh      77    NaN   kashmir

In [54]:
#delete column
std.drop("Address",axis = 1,inplace = True)#inplace = true makes the column dissapear permanently

In [55]:
std

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [5]:
#handling missing values
std.dropna(thresh =3)

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [9]:
#adding missing values
std["marks"].fillna("not confirmed", inplace = False)
std["marks"].fillna(method = "ffill")
std

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [24]:
std["Total"] = std["Mobile"] + std["marks"]
std

   USN    Name  Mobile  marks  Total
0  100    None      99   30.0  129.0
1  101     tom      88   35.0  123.0
2  102  ramesh      77    NaN    NaN

In [40]:
#mod 2


d1 = {'c1':[1,2,3],
      'c2':[10,11,12]
      }

d2 = {'c2':[21,22,23],
      'c4':[31,32,33]
     }

d3 = {'c5':[41,42,43],
      'c6':[51,52,53]
     }

In [34]:
df1 = pd.DataFrame(d1)
df1

   c1  c2
0   1  10
1   2  11
2   3  12

In [41]:
df2 = pd.DataFrame(d2)
df2

   c2  c4
0  21  31
1  22  32
2  23  33

In [36]:
df3 = pd.DataFrame(d3)
df3

   c5  c6
0  41  51
1  42  52
2  43  53

In [42]:
pd.concat([df1,df2], axis = 0)

    c1  c2    c4
0  1.0  10   NaN
1  2.0  11   NaN
2  3.0  12   NaN
0  NaN  21  31.0
1  NaN  22  32.0
2  NaN  23  33.0

In [43]:
pd.merge(df1, df2,how = 'inner', on = 'c2')

Empty DataFrame
Columns: [c1, c2, c4]
Index: []